export const priceMethods = {
   1: "Оплатити зараз",
   2: "Оплата при отриманні товару",
   3: "Безготівкові для юридичних осіб",
   4: "Оплатити онлайн соціальною картою 'Пакунок малюка'",
   5: "Безготівкові для фізічних осіб",
   6: "PrivatPay",
   7: "Кредит",
};

export const priceMethodsList = [
   {
      id: 1,
      label: "Оплатити зараз",
   },
   {
      id: 2,
      label: "Оплата при отриманні товару",
   },
   {
      id: 3,
      label: "Безготівкові для юридичних осіб",
   },
   {
      id: 4,
      label: "Оплатити онлайн соціальною картою 'Пакунок малюка'",
   },
   {
      id: 5,
      label: "Безготівкові для фізічних осіб",
   },
   {
      id: 6,
      label: "PrivatPay",
   },
   {
      id: 7,
      label: "Кредит",
   },
];
