import Product from "../models/Product";

const PRODUCTS = [
    new Product(
        1,
        "google-pixel-5",
        "Мобільний телефое Google pixel 5 5G 8/128 green",
        "Google pixel 5",
        "Google",
        "Phone",
        "Great Britain",
        "Great Britain",
        "https://cdn11.bigcommerce.com/s-ss31ap/images/stencil/1280x1280/products/7739/27700/41oKylGa%25252ByL__23085.1630999913.jpg?c=2",
        "Смартфон Google Pixel 5 8/128GB Just Black (EU - версія)\r / \r / \r / Екран:6 &quot;, 2340x1080 (19.5:9), 430 ppi\r / \r / Пам&#39;ять:128 ГБ, 8 ГБ ОЗП\r / \r / Процесор:8 ядер(а), 2.4 ГГц\r\r / Камера:2 модуля 16 МП (12.2 МП і 8 МП\r / \r / Відео:fullHD 60 к/с, ultraHD 4K, стабілізація\r / \r / Ємність батареї:4080 маг\r / \r / Вага:151 г",
        'Діагональ екрану - 6" / Тип екрану - OLED\r / Камера - 12 Мп + 16 Мп\r / Ємність акумулятора - 4080 mAh\r / Стандарт захисту - IP68',
        "2022-07-04T09:53:28.312235Z",
        "none",
        2,
        27000,
        true
    ),
    new Product(
        2,
        "noutbuk-acer-aspire-7-a715-42g-r0vs-nhqbfeu00a-charcoal-black",
        "Ноутбук Acer Aspire 7 A715-42G-R0VS (NH.QBFEU.00A) Charcoal Black",
        "Ноутбук Acer Aspire 7",
        "Asus",
        "Laptop",
        "Ukraine",
        "Ukraine",
        "https://content.rozetka.com.ua/goods/images/big/163386254.jpg",
        "\r / \t&nbsp;\r / \t&nbsp;\r / \r / \r / &nbsp;\r / \r / \r / \r / Топовий ноутбук лінійки Aspire\r / \r / Aspire 7 &mdash; компактний ноутбук із якісним Full HD IPS дисплеєм і багатим набором інтерфейсів. Завдяки продуктивній залозі, ноутбук чудово впорається із найвимогливішими завданнями, а також чудово підходить для сучасних ігор.\r / \r / Ключові характеристики:\r / \r / процесор AMD Ryzen 5 5500U (6 ядер/12 потоків)\r / \r / Високошвидкісна оперативна пам&#39;ять 8 ГБ DDR4 3200 МГц і швидкий SSD-накопичувач PCIe 512 ГБ (2 слоти для оперативної пам&#39;яті, один із яких зайнятий планкою 8 ГБ, максимальний обсяг ОЗП 32 ГБ)\r / \r / відеокарта NVIDIA GeForce GTX 1650 4 ГБ GDDR6\r / \r / ефективна система охолодження з 2 вентиляторами\r / \r / клавіатура з підсвіткою, сканер відбитків пальців, тачпад із підтримкою мультитач\r / \r / \r / \r / Дизайн\r / \r / Стриманий дизайн ноутбука ідеально підійде для будь-якого використання та вдало доповнить ваш образ. Завдяки малій вазі (2.15&nbsp;кг), а також тонкому корпусу (22.9&nbsp;мм) ноутбук Aspire 7 легко брати з собою в дорогу, він поміститься в будь-яку сумку.\r / \r / Aspire 7 обладнаний повнорозмірною клавіатурою з повноцінним цифровим блоком, а також підсвіткою білого кольору для комфортної роботи в умовах недостатнього освітлення. Ноутбук постачається з заводським гравіюванням українських, англійських і російських символів клавіатури.\r / \r / Зручний у керуванні тачпад Precision Touchpad пропонує можливість керування системою завдяки підтримці жестів. Вбудований сканер відбитків пальців забезпечує максимальний захист і простоту розблокування ноутбука одним дотиком.\r / \r / \r / \r / Продуктивність і охолодження\r / \r / Попри компактні розміри, ноутбук Aspire 7 вирізняється високою продуктивністю. Відеокарта NVIDIA GeForce GTX 1650 4 ГБ GDDR6 чудово підходить як для роботи, так і для ігор, а процесор AMD Ryzen 5 5500U забезпечує максимальну швидкість виконання ресурсомістких завдань. Поєднання швидкої оперативної пам&#39;яті 8 ГБ DDR4 і SSD-накопичувача PCIe 512 ГБ гарантує швидке завантаження програм і ефективну роботу в багатозадачному режимі.\r / \r / Система охолодження з 2 вентиляторами ефективно відводить тепло та дає змогу домогтися низьких показників температури за максимального навантаження.\r / \r / Середні показники продуктивності в іграх:\r / \r / Counter-Strike: GO (ультра) &mdash; 130 fps\r / \r / Fortnite (ультра) &mdash; 77 fps\r / \r / World of Tanks (ультра) &mdash; 82 fps\r / \r / Apex Legends (ультра) &mdash; 67 fps\r / \r / *Дані на основі внутрішнього тестування\r / \r / \r / \r / Екран\r / \r / Якісний екран діагоналлю 15.6 дюйма з IPS-матрицею і вузькими рамками дає змогу переглядати зображення, а технології Color Intelligence та ExaColor додатково покращують якість картинки. Завдяки вузьким рамкам екран займає практично 82% корпусу. Технологія Bluelight Shield подбає про захист ваших очей.\r / \r / \r / \r / Апгрейд\r / \r / Конфігурацію ноутбука можна змінювати, щоб збільшити швидкість швидкодії й обсяг місця для зберігання. Модель обладнана 8 ГБ оперативної пам&#39;яті, з можливістю апгрейду до 32 ГБ, а також SSD-накопичувачем PCIe місткістю 512 ГБ. Для апгрейду ноутбука в гарантійний період рекомендується звертатися у фірмовий сервісний центр Acer для збереження гарантії.\r / \r / \r / \r / Технології\r / \r / Багатий набір всіляких портів дає змогу під&#39;єднання різноманітної периферії, а порти USB Type-C і USB 3.2 забезпечують максимальну швидкість і сумісність із найсучаснішими пристроями. Один із портів USB дає змогу заряджати пристрої від ноутбука у вимкненому стані. Порт HDMI, забезпечує під&#39;єднання зовнішніх моніторів і проєкторів. Зручне розташування портів для комфортної роботи.\r / \r / Широкі можливості мережевого під&#39;єднання реалізовані новітнім дводіапазонним бездротовим модулем Intel Wi-Fi 6 (802.11ax) з підтримкою технології 2x2 MU-MIMO, гігабітним Ethernet контролером і Bluetooth 5.1.\r / \r / \r / \r / Звук\r / \r / Чітке та потужне звучання з двома динаміками та технологією Acer TrueHarmony.",
        'Екран 15.6" IPS (1920x1080) Full HD, матовий / AMD Ryzen 5 5500U (2.1 — 4.0 ГГц) / RAM 8 ГБ / SSD 512 ГБ / nVidia GeForce GTX 1650, 4 ГБ / без ОД / LAN / Wi-Fi / Bluetooth / вебкамера / без ОС / 2.15 кг / чорний',
        "2022-07-04T15:47:34.558505Z",
        "none",
        2,
        2700,
        true
    ),
    new Product(
        3,
        "google-pixel-5",
        "Google pixel 5",
        "Google pixel 5",
        "Google",
        "Phone",
        "Great Britain",
        "Great Britain",
        "https://cdn11.bigcommerce.com/s-ss31ap/images/stencil/1280x1280/products/7739/27700/41oKylGa%25252ByL__23085.1630999913.jpg?c=2",
        "Смартфон Google Pixel 5 8/128GB Just Black (EU - версія)\r / \r / \r / Екран:6 &quot;, 2340x1080 (19.5:9), 430 ppi\r / \r / Пам&#39;ять:128 ГБ, 8 ГБ ОЗП\r / \r / Процесор:8 ядер(а), 2.4 ГГц\r / \r / Камера:2 модуля 16 МП (12.2 МП і 8 МП\r / \r / Відео:fullHD 60 к/с, ultraHD 4K, стабілізація\r / \r / Ємність батареї:4080 маг\r / \r / Вага:151 г",
        'Діагональ екрану - 6"\r / Тип екрану - OLED\r / Камера - 12 Мп + 16 Мп\r / Ємність акумулятора - 4080 mAh\r / Стандарт захисту - IP68',
        "2022-07-04T09:53:28.312235Z",
        "none",
        2,
        27000,
        true
    ),
];

export default PRODUCTS;
